# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

In [7]:
connect = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = connect.cursor()

## Display the names of all the employees in Boston.

In [12]:
#Your code here
cur.execute('''SELECT firstName, lastName FROM employees JOIN offices using (officeCode) WHERE offices.city = 'Boston';''').fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?

In [13]:
#Your code here
cur.execute('''SELECT * FROM offices LEFT JOIN employees USING (officeCode);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print(len(df))
print(len(df.officeCode.isnull()))
df[df.officeCode.isnull()].head()
#all office codes have employees

23
23

Empty DataFrame
Columns: [officeCode, city, phone, addressLine1, addressLine2, state, country, postalCode, territory, employeeNumber, lastName, firstName, extension, email, reportsTo, jobTitle]
Index: []

## Write 3 Questions of your own and answer them

In [17]:
# Which customer has the most orders?
cur.execute('''SELECT customerName, count(orderNumber) FROM customers JOIN orders using (customerNumber) GROUP BY (customerNumber) ORDER BY count(orderNumber) DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                   customerName  count(orderNumber)
0        Euro+ Shopping Channel                  26
1  Mini Gifts Distributors Ltd.                  17
2    Australian Collectors, Co.                   5
3      Danish Wholesale Imports                   5
4       Dragon Souveniers, Ltd.                   5

In [23]:
# Who is the manager of the employee with the customer that has the lowest credit limit?
cur.execute("""SELECT reportsTo, firstName, customerName, creditLimit FROM employees e JOIN customers c on 
                        e.employeeNumber = c.salesRepEmployeeNumber 
                        order by c.creditLimit;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  reportsTo firstName             customerName creditLimit
0      1143  Foon Yue   American Souvenirs Inc        0.00
1      1102    Martin    Precious Collectables        0.00
2      1143     Steve    Diecast Classics Inc.   100600.00
3      1143    George            Mini Classics   102700.00
4      1056      Mami  Dragon Souveniers, Ltd.   103800.00

In [25]:
# Which is the highest selling product, in terms of quantity sold?
cur.execute("""SELECT productName, quantityOrdered FROM products p JOIN 
                    orderdetails od using(productCode) ORDER BY quantityOrdered DESC;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

                      productName quantityOrdered
0              1969 Dodge Charger              97
1            1969 Dodge Super Bee              90
2  America West Airlines B757-200              85
3         1970 Plymouth Hemi Cuda              77
4              F/A 18 Hornet 1/72              77

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [30]:
# Your code here
cur.execute("""SELECT firstName, lastName, productName FROM employees e 
                JOIN customers c on e.employeeNumber = c.salesRepEmployeeNumber 
                JOIN orders o using(customerNumber) JOIN orderdetails od using(orderNumber) 
                JOIN products p using (productCode);""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName  lastName                                  productName
0    Leslie  Jennings                               1958 Setra Bus
1    Leslie  Jennings                       1940 Ford Pickup Truck
2    Leslie  Jennings                      1939 Cadillac Limousine
3    Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4    Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [27]:
#Your code here
cur.execute("""SELECT firstName, lastName, count(productCode) FROM employees e JOIN 
                customers c on e.employeeNumber = c.salesRepEmployeeNumber 
                JOIN orders o using(customerNumber) JOIN orderdetails od 
                using(orderNumber) JOIN products p using (productCode) GROUP BY firstName;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName  count(productCode)
0      Andy     Fixter                 185
1     Barry      Jones                 220
2  Foon Yue      Tseng                 142
3    George     Vanauf                 211
4    Gerard  Hernandez                 396

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!